* Web service example for system
** Definition
Names are important. Which names? Those behind our favorite movies, that's who! So let us save them via a web service.

** Installation

In our development environment, we use a in-memory database and a web server listening on port 3025. In our production environment, we use a persistent database and a web server listening on port 8008.

Start the system with development settings: 
#+BEGIN_SRC sh
$ boot dev-run
#+END_SRC

Or with production settings:
#+BEGIN_SRC sh
$ boot prod-run
#+END_SRC

** Usage

To search for a movie’s director:

#+BEGIN_SRC sh :results output replace
curl -H "Content-Type: application/edn" -X POST -d '{:movie "Realm of the Senses"}' http://localhost:3025/movie 
#+END_SRC

#+RESULTS:
: {:director ("Nagisa Ōshima")}

To add a director to our database: 

#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X PUT -d '{:director "Nagisa Ōshima"}' http://localhost:3025/director
#+END_SRC

To list directors in our database: 

#+BEGIN_SRC sh :results output replace
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Nagisa Ōshima")

Let's look for another all-time favorite.  
#+BEGIN_SRC sh :results output replace
curl -H "Content-Type: application/edn" -X POST -d '{:movie "Professione: reporter"}' http://localhost:3025/movie 
#+END_SRC

#+RESULTS:
: {:director ("Michelangelo Antonioni")}

#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X PUT -d '{:director "Michelangelo Antonioni"}' http://localhost:3025/director
#+END_SRC

#+BEGIN_SRC sh :results output replace
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Nagisa Ōshima" "Michelangelo Antonioni")

And a last one: 
#+BEGIN_SRC sh :results output replace
curl -H "Content-Type: application/edn" -X POST -d '{:movie " À bout de souffle"}' http://localhost:3025/movie 
#+END_SRC

#+RESULTS:
: {:director ("Jean-Luc Godard")}

#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X PUT -d '{:director "Jean-Luc Godard"}' http://localhost:3025/director
#+END_SRC

We should now have three directors in our database:
#+BEGIN_SRC sh :results output replace :exports both
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Nagisa Ōshima" "Michelangelo Antonioni" "Jean-Luc Godard")

Let's suppose we want to remove one. 
#+BEGIN_SRC sh :results silent
curl -H "Content-Type: application/edn" -X DELETE -d '{:director "Nagisa Ōshima"}' http://localhost:3025/director
#+END_SRC

#+BEGIN_SRC sh :results output replace
curl http://localhost:3025/directors
#+END_SRC

#+RESULTS:
: ("Michelangelo Antonioni" "Jean-Luc Godard")

